src/toir_cfe/src/DataProcessors/проф_АктОСписанииРасходныхМатериаловДляТОиР/проф_АктОСписанииРасходныхМатериаловДляТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>проф_АктОСписанииРасходныхМатериаловДляТОиР</name>
  <comment>Проф-ИТ, #132, Горетовская М.С., 21.09.2023</comment>
</mdclass:DataProcessor>

src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f821681-4f9b-4186-85f8-a081e4ab09cf">
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a69f874-6aec-457e-8ade-4fb7762659ab">
    <name>проф_ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="048b6482-1229-4a9b-bde1-a32f6b28cf3d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c978a924-8a72-4669-a86a-a1e5e31fd099">
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="54be410d-2466-478e-8cf5-434ec98e19f1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b8217a5-5b59-453d-b479-c9c962e72312">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39aa0f15-c415-409c-a64b-12fd0ee1e845">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/DataProcessors/проф_АктОСписанииРасходныхМатериаловДляТОиР/ObjectModule.bsl
//++ Проф-ИТ, #132, Башинская А., 13.10.2023

#Область ПрограммныйИнтерфейс

Функция ПечатьАктОСписании(МассивОбъектов, ПараметрыПечати) Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("проф_АктОСписании");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов); 
	Запрос.Текст = ТекстЗапросаПечатьАктОСписании();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ПолучитьПарамерыШапки(ВыборкаСсылка));
		ТабДок.Вывести(ОбластьШапка);
		
		нпп = 0;
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьДанныеСтроки(ОбластьСтрока, ВыборкаДетальныеЗаписи, нпп);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ОбластьИтого.Параметры, ВыборкаСсылка);
		ТабДок.Вывести(ОбластьИтого);
		
		ТабДок.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПечатьАктОСписании()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
       |	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка,
       |	ВнутреннееПотреблениеТоваров.Номер КАК Номер,
       |	ВнутреннееПотреблениеТоваров.Дата КАК Дата,
       |	ВнутреннееПотреблениеТоваров.проф_ДокументОснование КАК проф_ДокументОснование
       |ПОМЕСТИТЬ ВТ_Документы
       |ИЗ
       |	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
       |ГДЕ
       |	ВнутреннееПотреблениеТоваров.Ссылка В(&МассивОбъектов)
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ ПЕРВЫЕ 1
       |	ВТ_Документы.Ссылка КАК Ссылка,
       |	ЕСТЬNULL(торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта, ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК ОбъектРемонта
       |ПОМЕСТИТЬ ВТ_ОбъектыРемонта
       |ИЗ
       |	ВТ_Документы КАК ВТ_Документы
       |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
       |		ПО ВТ_Документы.проф_ДокументОснование = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
       |	ВТ_Документы.Ссылка КАК Ссылка,
       |	ВТ_Документы.Номер КАК Номер,
       |	ВТ_Документы.Дата КАК Дата,
       |	ЕСТЬNULL(Товары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
       |	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Товары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК НоменклатураПредставление,
       |	ЕСТЬNULL(Товары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
       |	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Товары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ХарактеристикаПредставление,
       |	ВЫБОР
       |		КОГДА ЕСТЬNULL(Товары.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
       |			ТОГДА ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(спрНоменклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)))
       |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Товары.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)))
       |	КОНЕЦ КАК ЕдиницаИзмерения,
       |	ЕСТЬNULL(Товары.Количество, 0) КАК Количество,
       |	ЕСТЬNULL(проф_СебестоимостьТоваров.Себестоимость, 0) КАК Сумма,
       |	ВЫБОР
       |		КОГДА ЕСТЬNULL(проф_СебестоимостьТоваров.Количество, 0) = 0
       |			ТОГДА 0
       |		ИНАЧЕ ВЫРАЗИТЬ(проф_СебестоимостьТоваров.Себестоимость / проф_СебестоимостьТоваров.Количество КАК ЧИСЛО(15, 2))
       |	КОНЕЦ КАК Цена,
       |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(ВТ_ОбъектыРемонта.ОбъектРемонта), """") КАК Объект
       |ИЗ
       |	ВТ_Документы КАК ВТ_Документы
       |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК Товары
       |		ПО ВТ_Документы.Ссылка = Товары.Ссылка
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.проф_СебестоимостьТоваров КАК проф_СебестоимостьТоваров
       |		ПО ВТ_Документы.Ссылка = проф_СебестоимостьТоваров.Документ
       |			И (Товары.Номенклатура = проф_СебестоимостьТоваров.Номенклатура)
       |			И (Товары.Характеристика = проф_СебестоимостьТоваров.Характеристика)
       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
       |		ПО (Товары.Номенклатура = спрНоменклатура.Ссылка)
       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта
       |		ПО ВТ_Документы.Ссылка = ВТ_ОбъектыРемонта.Ссылка
       |ИТОГИ
       |	МАКСИМУМ(Номер),
       |	МАКСИМУМ(Дата),
       |	СУММА(Сумма)
       |ПО
       |	Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьПарамерыШапки(ВыборкаСсылка)
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаДок", Формат(ВыборкаСсылка.Дата, "ДЛФ=D"));
	
	МесяцВПП = ПолучитьСклоненияСтроки(Формат(ВыборкаСсылка.Дата, "ДФ=ММММ"), "ПЛ=Мужской", "ПД=Предложный");
	
	СтрВПериоде = СтрШаблон("в %1 %2г.",
								НРег(МесяцВПП[0]),
								Формат(ВыборкаСсылка.Дата, "ДФ=гггг"));
	Результат.Вставить("ВПериоде", СтрВПериоде);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеСтроки(ОбластьСтрока, ВыборкаДетальныеЗаписи, нпп)
	
	ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаДетальныеЗаписи);
	нпп = нпп + 1;
	ОбластьСтрока.Параметры.нпп = нпп;
	
	Материал = ВыборкаДетальныеЗаписи.НоменклатураПредставление;
	Если ВыборкаДетальныеЗаписи.ХарактеристикаПредставление <> "" Тогда
		Материал = Материал + ", " + ВыборкаДетальныеЗаписи.ХарактеристикаПредставление; 
	КонецЕсли;
	
	ОбластьСтрока.Параметры.Материал = Материал;
	
КонецПроцедуры

#КонецОбласти

//-- Проф-ИТ, #132, Башинская А., 13.10.2023
